In [1]:
seq = [1,2,3,4,5]

In [4]:
for e in seq:
    print(e)

1
2
3
4
5

In [9]:
seq1 = [5,6,7,8]

In [11]:
for zarmeen in seq1:
    print(zarmeen)

5
6
7
8

In [12]:
range(10)

range(0, 10)

In [ ]:
for e in

In [1]:
x = 3
y = 7

In [2]:
4*x + 3

15

In [3]:
(x/2)**(1/2)

1.224744871391589

In [4]:
(x+1) /(1-y)

-0.6666666666666666

In [5]:
((x**2) + 2)/(1 - (y**3))

-0.03216374269005848

In [8]:
list4 = [11,12,13,14,15,16,17,18,19,20]

In [9]:
len(list4)

10

In [7]:
list5 = []

In [11]:
for i in range(0,len(list4)):
    if i % 2 != 0:
        list5.append(i)

In [13]:
for i in range(0,len(list4)):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [12]:
list5

[1, 3, 5, 7, 9]

In [6]:
import pandas as pd

In [2]:
calories = [420,380,390]
duration = [50,40,45]

In [3]:
data = {"calories" : calories ,"duration" : duration}

In [4]:
data

{'calories': [420, 380, 390], 'duration': [50, 40, 45]}

In [7]:
Data1 = pd.DataFrame(data)
Data1

   calories  duration
0       420        50
1       380        40
2       390        45

In [8]:
# refer to the row index:
Data1.loc[2]

calories    390
duration     45
Name: 2, dtype: int64

In [9]:
Data = pd.DataFrame(data, index = ["day1" , "day2" , "day3"])
Data

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [10]:
Data.loc["day3"]

calories    390
duration     45
Name: day3, dtype: int64

In [12]:
url = "https://raw.githubusercontent.com/jackty9/Handling_Imbalanced_Data_in_Python/master/bank-full-encoded.csv"
df = pd.read_csv(url)

In [14]:
df.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,40,4,1,2,0,3036,1,0,2,4,8,261,0,0,0,3,0
1,26,9,2,1,0,945,1,0,2,4,8,151,0,0,0,3,0

In [15]:
df.tail(3)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
45208,54,5,1,1,0,5455,0,0,0,16,9,1116,4,181,3,2,1
45209,39,1,1,1,0,1584,0,0,1,16,9,508,3,0,0,3,0
45210,19,2,1,1,0,3779,0,0,0,16,9,361,1,185,11,1,0

In [16]:
df.shape

(45211, 17)

In [17]:
df.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [18]:
df["marital"].unique()

array([1, 2, 0], dtype=int64)

In [19]:
df["marital"] == 1

0         True
1        False
2         True
3         True
4        False
         ...
45206     True
45207    False
45208     True
45209     True
45210     True
Name: marital, Length: 45211, dtype: bool

In [20]:
df.loc[df["marital"] == 1,]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,40,4,1,2,0,3036,1,0,2,4,8,261,0,0,0,3,0
2,15,2,1,1,0,918,1,1,2,4,8,76,0,0,0,3,0
3,29,1,1,3,0,2420,1,0,2,4,8,92,0,0,0,3,0
5,17,4,1,2,0,1147,1,0,2,4,8,139,0,0,0,3,0
8,40,5,1,0,0,1037,1,0,2,4,8,50,0,0,0,3,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45204,55,5,1,1,0,3678,0,0,0,16,9,300,0,37,8,0,1
45206,33,9,1,2,0,1741,0,0,0,16,9,975,2,0,0,3,1
45208,54,5,1,1,0,5455,0,0,0,16,9,1116,4,181,3,2,1
45209,39,1,1,1,0,1584,0,0,1,16,9,508,3,0,0,3,0
45210,19,2,1,1,0,3779,0,0,0,16,9,361,1,185,11,1,0

In [21]:
df["education"].unique()

array([2, 1, 3, 0], dtype=int64)

In [22]:
df["education"] == 2

0         True
1        False
2        False
3        False
4        False
         ...
45206     True
45207    False
45208    False
45209    False
45210    False
Name: education, Length: 45211, dtype: bool

In [ ]:
df.loc[

In [27]:
df.loc[df["marital"] == 1 ,["age","job"]]

       age  job
0       40    4
2       15    2
3       29    1
5       17    4
8       40    5
...    ...  ...
45204   55    5
45206   33    9
45208   54    5
45209   39    1
45210   19    2

[27214 rows x 2 columns]

In [85]:
df.loc[df["marital"] == 1 ,].shape[0]

27214

In [81]:
df.loc[df["marital"] == 1 ,["housing","loan","pdays"]]

       housing  loan  pdays
0            1     0      0
2            1     1      0
3            1     0      0
5            1     0      0
8            1     0      0
...        ...   ...    ...
45204        0     0     37
45206        0     0      0
45208        0     0    181
45209        0     0      0
45210        0     0    185

[27214 rows x 3 columns]

In [32]:
(df["marital"] == 1 ) &  (df["education"] == 2)

0         True
1        False
2        False
3        False
4        False
         ...
45206     True
45207    False
45208    False
45209    False
45210    False
Length: 45211, dtype: bool

In [34]:
df["marital"] == 1

0        1
1        2
2        1
3        1
4        2
        ..
45206    1
45207    0
45208    1
45209    1
45210    1
Name: marital, Length: 45211, dtype: int64

In [35]:
df["marital"] == 1

0         True
1        False
2         True
3         True
4        False
         ...
45206     True
45207    False
45208     True
45209     True
45210     True
Name: marital, Length: 45211, dtype: bool

In [1]:
import pandas as pd

In [29]:
condition_1 = (df["marital"] == 1) & (df["education"] == 2)

In [30]:
subset1 = df.loc[condition_1,]
subset1.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,40,4,1,2,0,3036,1,0,2,4,8,261,0,0,0,3,0
5,17,4,1,2,0,1147,1,0,2,4,8,139,0,0,0,3,0
21,38,4,1,2,0,1695,1,0,2,4,8,164,0,0,0,3,0
31,31,4,1,2,0,1294,1,0,2,4,8,230,0,0,0,3,0
34,33,4,1,2,0,6573,1,0,2,4,8,336,0,0,0,3,0

In [13]:
df.dtypes

age          int64
job          int64
marital      int64
education    int64
default      int64
balance      int64
housing      int64
loan         int64
contact      int64
day          int64
month        int64
duration     int64
campaign     int64
pdays        int64
previous     int64
poutcome     int64
y            int64
dtype: object

In [36]:
df["marital"].dtypes

dtype('int64')

In [43]:
df["marital"].unique()

array([1, 2, 0], dtype=int64)

In [37]:
df["marital"] = df["marital"].astype("category")

In [38]:
df["marital"].dtypes

CategoricalDtype(categories=[0, 1, 2], ordered=False)

In [46]:
df.dtypes

age             int64
job             int64
marital      category
education       int64
default         int64
balance         int64
housing         int64
loan            int64
contact         int64
day             int64
month           int64
duration        int64
campaign        int64
pdays           int64
previous        int64
poutcome        int64
y               int64
dtype: object

In [47]:
df["education"].unique()

array([2, 1, 3, 0], dtype=int64)

In [41]:
df["loan"].unique()

array([0, 1], dtype=int64)

In [45]:
df["loan"] = df["loan"].astype("category")

In [46]:
df["loan"].dtypes

CategoricalDtype(categories=[0, 1], ordered=False)

In [39]:
df["education"] = df["education"].astype("category")

In [49]:
df["education"].unique()

[2, 1, 3, 0]
Categories (4, int64): [0, 1, 2, 3]

In [98]:
# Group by Command in Pandas

In [47]:
A = ["a", "b", "c", "a","a","b","c"]
B = ['1','4', '5', '8','7','5','7']

In [48]:
data = {"A": A, "B" : B}

In [49]:
df = pd.DataFrame(data)

In [51]:
df

   A  B
0  a  1
1  b  4
2  c  5
3  a  8
4  a  7
5  b  5
6  c  7

In [52]:
df.dtypes

A    object
B    object
dtype: object

In [53]:
df["A"] = df["A"].astype("category")
df["B"] = df["B"].astype("int64")

In [24]:
df.dtypes

A    category
B       int64
dtype: object

In [25]:
df

   A  B
0  a  1
1  b  4
2  c  5
3  a  8
4  a  7
5  b  5
6  c  7

In [54]:
df.groupby("A").sum()

    B
A
a  16
b   9
c  12

In [55]:
df.groupby("A").min()

   B
A
a  1
b  4
c  5

In [56]:
df.groupby("A").max()
df.groupby("A").mean()

          B
A
a  5.333333
b  4.500000
c  6.000000

In [57]:
# Define a dictionary containing employee data
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']}

In [58]:
df1 = pd.DataFrame(data1)

In [59]:
df1

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [65]:
df1.groupby(["Qualification"]).groups["MCA"]

Int64Index([2], dtype='int64')

In [73]:
df1.loc[df1.groupby(["Qualification"]).groups["Msc"]][["Name","Address"]]

     Name    Address
0     Jai     Nagpur
6  Princi  Allahabad

In [61]:
df1.groupby(["Address"]).groups.keys()

dict_keys(['Aligarh', 'Allahabad', 'Jaunpur', 'Kannuaj', 'Kanpur', 'Nagpur'])

In [123]:
df1.groupby(["Name"]).groups.keys()

dict_keys(['Abhi', 'Anuj', 'Gaurav', 'Jai', 'Princi'])

In [37]:
df1.groupby(["Address"]).groups["Allahabad"]

Int64Index([2, 6], dtype='int64')

In [129]:
df1.groupby(["Qualification"]).groups

{'B.Tech': [4], 'B.com': [5], 'MA': [1, 7], 'MCA': [2], 'Msc': [0, 6], 'Phd': [3]}

In [39]:
df1.loc[df1["Qualification"] == 'Msc',]

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
6  Princi   27  Allahabad           Msc

In [74]:
df1.groupby(["Qualification"]).get_group('Msc')

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
6  Princi   27  Allahabad           Msc

In [75]:
df = pd.read_csv('https://raw.githubusercontent.com/datagy/data/main/sales.csv', parse_dates=['date'])

In [76]:
df.head(2)

        date gender      region  sales
0 2022-08-22   Male  North-West  20381
1 2022-03-05   Male  North-East  14495

In [78]:
df.groupby("region")["sales"].mean()

region
North-East    17386.072046
North-West    15257.732919
South         24466.864048
Name: sales, dtype: float64

In [43]:
df.shape

(1000, 4)

In [46]:
df["region"].unique()

array(['North-West', 'North-East', 'South'], dtype=object)

In [47]:
df["region"].nunique()

3

In [79]:
df.groupby("region").ngroups

3

In [80]:
df.groupby("region").groups.keys()

dict_keys(['North-East', 'North-West', 'South'])

In [81]:
subset_2 = df.groupby("region").get_group('South')
subset_2.shape

(331, 4)

In [146]:
df.loc[df["region"] == 'South',].shape

(331, 4)

In [138]:
df.groupby("region")["sales"].mean().round(0)

region
North-East    17386.0
North-West    15258.0
South         24467.0
Name: sales, dtype: float64

In [88]:
# The sum of the value
df.groupby("region")["sales"].mean().round(2)

region
North-East    17386.07
North-West    15257.73
South         24466.86
Name: sales, dtype: float64

In [159]:
# The maximum value of the group
df.groupby("region")["sales"].max().round(0)

region
North-East    22545
North-West    26813
South         43775
Name: sales, dtype: int64

In [167]:
# The median value of the group
df.groupby("region")["sales"].median().round(0)

region
North-East    17414.0
North-West    15338.0
South         24492.0
Name: sales, dtype: float64

In [89]:
# The Variance  of the group
df.groupby("region")["sales"].var().round(0)

region
North-East     4131225.0
North-West    13114947.0
South         27601390.0
Name: sales, dtype: float64

In [90]:
# The number of non-null records
df.groupby("region")["sales"].count()

region
North-East    347
North-West    322
South         331
Name: sales, dtype: int64

In [160]:
# The minimum value of the group
df.groupby("region")["sales"].min().round(0)

region
North-East    11664
North-West     6084
South         10768
Name: sales, dtype: int64

In [147]:
df["region"].value_counts()

North-East    347
South         331
North-West    322
Name: region, dtype: int64

In [149]:
df.loc[df["region"] == 'South',].shape

(331, 4)

In [150]:
df.loc[df["region"] == 'North-East',].shape

(347, 4)

In [151]:
df.loc[df["region"] == 'North-West',].shape

(322, 4)

In [152]:
df["gender"].unique()

array(['Male', 'Female'], dtype=object)

In [155]:
df["gender"].value_counts()

Female    505
Male      495
Name: gender, dtype: int64

In [156]:
df.loc[df["gender"] == "Female"].shape[0]

505

In [157]:
df.loc[df["gender"] == "Male"].shape[0]

495

In [166]:
round(4.567,2)

4.57